In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
df=pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [7]:
df['full_name']=df['first']+ ' ' +df['last']

In [8]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [12]:
df.drop(columns=['first','last'],inplace=True)

In [13]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [15]:
df['full_name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [16]:
df [['first','last']]=df['full_name'].str.split(' ',expand=True)

In [17]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [18]:
df.append({'first':'Tony'},ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [29]:
people = {
    "first": ["Tony", 'Jane'], 
    "last": ["Stark", 'Doe'], 
    "email": ["abc@gmail.com", 'efg@email.com']
}
df2=pd.DataFrame(people)

In [30]:
df2

  first   last          email
0  Tony  Stark  abc@gmail.com
1  Jane    Doe  efg@email.com

In [31]:

df.append(df2,ignore_index=True,sort=False)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3            abc@gmail.com            NaN   Tony    Stark
4            efg@email.com            NaN   Jane      Doe
5            abc@gmail.com            NaN   Tony    Stark
6            efg@email.com            NaN   Jane      Doe
7            abc@gmail.com            NaN   Tony    Stark
8            efg@email.com            NaN   Jane      Doe

In [26]:
df=df.append(df2,ignore_index=True,sort=False)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3            abc@gmail.com            NaN   Tony    Stark
4            efg@email.com            NaN   Jane      Doe
5            abc@gmail.com            NaN   Tony    Stark
6            efg@email.com            NaN   Jane      Doe

In [34]:
df.drop(index=[4,5,6])

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3            abc@gmail.com            NaN   Tony    Stark

In [43]:
filt=df['last']=='Stark'
df=df.drop(index=df[filt].index)

In [44]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer